DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(25).
01 WS_CLASS PIC(2) VALUE '10'.


01 WS_ADDRESS 
   05 WS-HOUSE-NUMBER    PIC 9(3).
   05 WS-STREET          PIC X(15).
   05 WS-CITY            PIC X(15).
   05 WS-COUNTRY         PIC X(15)  VALUE 'DEUT'.